Updated readme file
